Documents/абс_ТранспортныйМаршрут/абс_ТранспортныйМаршрут.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ТранспортныйМаршрут</name>
  <attributes>
    <name>СводнаяЗаявкаНаТранспорт</name>
    <type>
      <types>DocumentRef.абс_СводнаяЗаявкаНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.абс_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТКПеревозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительЭкспедитор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоручениеЭкспедитору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияТранспортногоМаршрута</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Задания</name>
    <attributes>
      <name>ЗаявкаНаТранспорт</name>
      <type>
        <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормироватьДоверенность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Доверенность</name>
      <type>
        <types>DocumentRef.Доверенность</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Enums/абс_ВидыДоверенностей/абс_ВидыДоверенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыДоверенностей</name>
  <enumValues>
    <name>ПолучениеТМЦ</name>
  </enumValues>
  <enumValues>
    <name>СдачаТМЦ</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_СтатусыЗаявокНаТранспорт/абс_СтатусыЗаявокНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыЗаявокНаТранспорт</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>КИсполнению</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_СтатусыОтгрузки/абс_СтатусыОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыОтгрузки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Подобран</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаСборка</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_СтатусыПеремещенийТоваров/абс_СтатусыПеремещенийТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПеремещенийТоваров</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Documents/Доверенность/Доверенность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Доверенность</name>
  <comment>(Общ)</comment>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.СчетНаОплатуПоставщика</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДействия</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаПолучениеОт</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДокументу</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДокументОснование</name>
    <type>
      <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КорешокДоверенностиПолучен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВыводитьТабличнуюЧастьСтрокой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВидДоверенности</name>
    <type>
      <types>EnumRef.абс_ВидыДоверенностей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>НаименованиеТовара</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаПоКлассификатору</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_ТранспортныйМаршрут/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	
	ПриИзмененииТранспортногоСредства_Сервер();
	
	УстановитьСвязиПараметровВыбораВодителяТС();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииТранспортногоСредства_Сервер()
	
	Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		Объект.ВодительЭкспедитор = Объект.ТранспортноеСредство.ВодительПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДоверенности(Команда)
	
	Если Вопрос("Сформировать доверенности по отмеченным заявка на транспорт?",РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДоверенностиПоСводнымЗаявкамТранспортногоМаршрута_Сервер();
	
КонецПроцедуры

//процедура формирует доверенности в строках транспортного маршрута, где установлен флаг "Формировать доверенность"
//при формировании происходит поиск уже существующей доверенности по реквизиту "абс_ДокументОснование", если найдена - перезаписываем
&НаСервере
Процедура ОбновитьДоверенностиПоСводнымЗаявкамТранспортногоМаршрута_Сервер()
	
	Для Каждого СтрокаТаб Из Объект.Задания Цикл
		Если СтрокаТаб.ФормироватьДоверенность Тогда
			СтрокаТаб.Доверенность = СформироватьДоверенностьПоЗаявкеНаТранспорт(СтрокаТаб);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СформироватьДоверенностьПоЗаявкеНаТранспорт(СтрокаТабЧасти)
	
	ДоверенностьСсылка = Документы.Доверенность.НайтиПоРеквизиту("абс_ДокументОснование",СтрокаТабЧасти.ЗаявкаНаТранспорт);
	Если ДоверенностьСсылка.Пустая() Тогда
		ДоверенностьОбъект = Документы.Доверенность.СоздатьДокумент();
		ДоверенностьОбъект.абс_ДокументОснование = СтрокаТабЧасти.ЗаявкаНаТранспорт;
	Иначе
		ДоверенностьОбъект = ДоверенностьСсылка.ПолучитьОбъект();
		ДоверенностьОбъект.Товары.Очистить();
	КонецЕсли;
	
	ДоверенностьОбъект.Дата = Объект.Дата;
	ДоверенностьОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДоверенностьОбъект.Организация        = СтрокаТабЧасти.ЗаявкаНаТранспорт.Организация;
	ДоверенностьОбъект.ФизЛицо            = Объект.ВодительЭкспедитор;
	ДоверенностьОбъект.Контрагент         = СтрокаТабЧасти.ЗаявкаНаТранспорт.Контрагент;
	ДоверенностьОбъект.ДоговорКонтрагента = СтрокаТабЧасти.ЗаявкаНаТранспорт.Контрагент.ОсновнойДоговорКонтрагента;
	ДоверенностьОбъект.ДатаДействия       = Объект.Дата + 10*(3600*24);
	ДоверенностьОбъект.Подразделение      = СтрокаТабЧасти.ЗаявкаНаТранспорт.Подразделение;
	ДоверенностьОбъект.абс_ВидДоверенности= Перечисления.абс_ВидыДоверенностей.ПолучениеТМЦ;
	ДоверенностьОбъект.абс_ВыводитьТабличнуюЧастьСтрокой=Истина;
	
	Если Не СтрокаТабЧасти.ЗаявкаНаТранспорт.ДокументОтгрузки.Пустая() Тогда
		ДоверенностьОбъект.ПоДокументу        = "№ "+СокрЛП(СтрокаТабЧасти.ЗаявкаНаТранспорт.ДокументОтгрузки.Номер)+" от "+Формат(СтрокаТабЧасти.ЗаявкаНаТранспорт.ДокументОтгрузки.Дата,"ДФ=дд.ММ.гггг");
		ДоверенностьОбъект.НаПолучениеОт	  = СтрокаТабЧасти.ЗаявкаНаТранспорт.ДокументОтгрузки.Склад.абс_Контрагент;
	ИначеЕсли ЗначениеЗаполнено(СтрокаТабЧасти.ЗаявкаНаТранспорт.ДокументОснование) Тогда
		ДоверенностьОбъект.ПоДокументу        = "№ "+СокрЛП(СтрокаТабЧасти.ЗаявкаНаТранспорт.ДокументОснование.Номер)+" от "+Формат(СтрокаТабЧасти.ЗаявкаНаТранспорт.ДокументОснование.Дата,"ДФ=дд.ММ.гггг");
		
		Если ТипЗнч(СтрокаТабЧасти.ЗаявкаНаТранспорт.ДокументОснование) <> Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		     ДоверенностьОбъект.НаПолучениеОт	  = СтрокаТабЧасти.ЗаявкаНаТранспорт.ДокументОснование.СкладОтправитель.абс_Контрагент;
		 Иначе	 
			 ДоверенностьОбъект.НаПолучениеОт	  = СтрокаТабЧасти.ЗаявкаНаТранспорт.ДокументОснование.Склад.абс_Контрагент;
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрокаТаб ИЗ СтрокаТабЧасти.ЗаявкаНаТранспорт.Товары Цикл
		НоваяСтрока = ДоверенностьОбъект.Товары.Добавить();
		НоваяСтрока.НаименованиеТовара      = Строка(СтрокаТаб.Номенклатура);
		НоваяСтрока.Количество              = СтрокаТаб.Количество;
		НоваяСтрока.ЕдиницаПоКлассификатору = ?(ТипЗнч(СтрокаТаб.ЕдиницаИзмерения)=Тип("СправочникСсылка.ЕдиницыИзмерения"),СтрокаТаб.ЕдиницаИзмерения.ЕдиницаПоКлассификатору,СокрЛП(СтрокаТаб.ЕдиницаИзмерения));
	КонецЦикла;
	
	Попытка
		ДоверенностьОбъект.Записать();
		Результат = ДоверенностьОбъект.Ссылка;
	Исключение
		Сообщить("По документу " + Строка(СтрокаТабЧасти.ЗаявкаНаТранспорт) + " доверенность не сформирована! " + ОписаниеОшибки(),СтатусСообщения.Важное);
		Результат = Документы.Доверенность.ПустаяСсылка();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПечататьДоверенности(Команда)
	
	Если Вопрос("Вывести на печать доверенности по заявкам на транспорт?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПечатьДоверенностей_Сервер();
	
КонецПроцедуры

&НаСервере
Процедура ПечатьДоверенностей_Сервер()
	
	Для Каждого СтрокаТаб ИЗ Объект.Задания Цикл
		Если ЗначениеЗаполнено(СтрокаТаб.Доверенность) Тогда
			ДоверенностьОбъект = СтрокаТаб.Доверенность.ПолучитьОбъект();
			ДоверенностьОбъект.Печать("М2");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ИзменитьНомерДокумента_Сервер();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьНомерДокумента_Сервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Объект.Номер = ДокОбъект.ПолучитьНомерНовогоТранспортногоМаршрута();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияЗаявкаНаТранспортОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВодительЭкспедиторПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ВодительЭкспедитор) Тогда
		Объект.ТранспортноеСредство = Объект.ВодительЭкспедитор.абс_ОсновноеТранспортноеСредство;
	КонецЕсли;
	
	УстановитьСвязиПараметровВыбораВодителяТС();
		
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Если статус документа "Закрыт", то статусы заданий должны быть "В пути", "Закрыт" или "К исполнению"
	Если Объект.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.Закрыт Тогда
		Для каждого Стр из Объект.Задания Цикл
			Если Не (Стр.ЗаявкаНаТранспорт.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.КИсполнению
				ИЛИ Стр.ЗаявкаНаТранспорт.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.ВПути
				ИЛИ Стр.ЗаявкаНаТранспорт.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.Закрыт) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("По документу " + Стр.ЗаявкаНаТранспорт + " установлен статус " + Стр.Статус + 
							". Транспортный маршрут не может быть переведен в статус закрыт");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//проставим статусы
	Для Каждого Стр Из Объект.Задания Цикл
		Если Стр.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.КИсполнению Тогда 
			СтатусОтгрузки = Перечисления.абс_СтатусыОтгрузки.Отгружен
		ИначеЕсли Стр.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.Исполнение Тогда 
			СтатусОтгрузки = Перечисления.абс_СтатусыОтгрузки.Отгружен
		ИначеЕсли Стр.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.ВПути Тогда 
			СтатусОтгрузки = Перечисления.абс_СтатусыОтгрузки.ВПути
        ИначеЕсли Стр.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.Закрыт Тогда 
			СтатусОтгрузки = Перечисления.абс_СтатусыОтгрузки.Доставлен
		КонецЕсли;
		
		абс_СтатусыОтгрузок.ИзменитьСтатусОбъекта(Стр.ЗаявкаНаТранспорт, Стр.Статус);
		
		//+Лно Сафонов Е.А.
        //Не меняем статус у отгрузочных документов
		
		//Если Не Стр.ЗаявкаНаТранспорт.ЗаказПокупателя.Пустая() Тогда
		//	абс_СтатусыОтгрузок.ИзменитьСтатусОбъекта(Стр.ЗаявкаНаТранспорт.ЗаказПокупателя, СтатусОтгрузки);
		//КонецЕсли;
		//Если Не Стр.ЗаявкаНаТранспорт.ДокументОтгрузки.Пустая() Тогда
		//	абс_СтатусыОтгрузок.ИзменитьСтатусОбъекта(Стр.ЗаявкаНаТранспорт.ДокументОтгрузки, СтатусОтгрузки);
		//КонецЕсли;
		
		//-Лно Сафонов Е.А.
		
		ДокументОснование = Стр.ЗаявкаНаТранспорт.ДокументОснование;
		Если ЗначениеЗаполнено(ДокументОснование) и ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			Если Стр.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.Закрыт Тогда 
				СтатусПеремещения = Перечисления.абс_СтатусыПеремещенийТоваров.Закрыт;
			Иначе 
				СтатусПеремещения = Перечисления.абс_СтатусыПеремещенийТоваров.Исполнение;
			КонецЕсли;
			
			абс_СтатусыОтгрузок.ИзменитьСтатусОбъекта(ДокументОснование, СтатусПеремещения);
			
			абс_ТранспортнаяЛогистика.ЗаполнитьДанныеДляПечатиТТНВПеремещении(ДокументОснование, ТекущийОбъект.Ссылка, Стр.ЗаявкаНаТранспорт);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьСтатусы();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьСтатусы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусы()
	
	Для каждого СтрокаТЧ из Объект.Задания Цикл
		СтрокаТЧ.Статус = СтрокаТЧ.ЗаявкаНаТранспорт.Статус;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаданияСтатусПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Задания.ТекущиеДанные;
	Если Не ТекущаяСтрока = Неопределено Тогда
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ДатаДоставки) Тогда
			ткДата = ТекущаяДата();
			ВвестиДату(ткДата, , ЧастиДаты.Дата);
			ТекущаяСтрока.ДатаДоставки = ткДата;
		КонецЕслИ;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ЗаданияДокументОтгрузки Тогда
		ДокументОтгрузки = Объект.Задания[ВыбраннаяСтрока].ЗаявкаНаТранспорт.ДокументОтгрузки;
		Если ЗначениеЗаполнено(ДокументОтгрузки) Тогда
			ДокументОтгрузки.ПолучитьФорму().Открыть();
		КонецЕсли;
	ИначеЕсли Поле = Элементы.ЗаданияЗаявкаНаТранспорт Тогда
		ЗаявкаНаТранспорт = Объект.Задания[ВыбраннаяСтрока].ЗаявкаНаТранспорт;
		Если ЗначениеЗаполнено(ЗаявкаНаТранспорт) Тогда
			ЗаявкаНаТранспорт.ПолучитьФорму().Открыть();
		КонецЕсли;
	ИначеЕсли Поле = Элементы.ЗаданияДокументОснование Тогда
		ДокументОснование = Объект.Задания[ВыбраннаяСтрока].ДокументОснование;
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			ДокументОснование.ПолучитьФорму().Открыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязиПараметровВыбораВодителяТС()
	
	ПустойМассив = Новый Массив;
	
	Элементы.ТранспортноеСредство.СвязиПараметровВыбора = Новый ФиксированныйМассив(ПустойМассив);
	Элементы.ВодительЭкспедитор.СвязиПараметровВыбора = Новый ФиксированныйМассив(ПустойМассив);
	
	Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.абс_ОсновноеТранспортноеСредство", "Объект.ТранспортноеСредство");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.ВодительЭкспедитор.СвязиПараметровВыбора = НовыеСвязи;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ВодительЭкспедитор) Тогда
		
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.ВодительПоУмолчанию", "Объект.ВодительЭкспедитор");
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НоваяСвязь);
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		
		Элементы.ТранспортноеСредство.СвязиПараметровВыбора = НовыеСвязи;
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьСвязиПараметровВыбораВодителяТС();
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ЭтотОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_ТранспортныйМаршрут")); 
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента( , ЭтотОбъект, ЭтаФорма);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ЭтотОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.абс_ТранспортныйМаршрут")); 
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента( , ЭтотОбъект, ЭтаФорма);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаявкуНаТранспорт(Команда)
	
	ТекущиеДанные = Элементы.Задания.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаявкаНаТранспорт = ТекущиеДанные.ЗаявкаНаТранспорт;
	
	НачатьТранзакцию();
	
	ЗаявкаОбъект = ЗаявкаНаТранспорт.ПолучитьОбъект();
	ЗаявкаОбъект.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.КИсполнению;
	
	Попытка
		ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось записать документ " + ЗаявкаОбъект;
		Сообщение.Сообщить();
		ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
	
	МассивСтрок = Объект.Задания.НайтиСтроки(Новый Структура("ЗаявкаНаТранспорт", ТекущиеДанные.ЗаявкаНаТранспорт));
	
	Объект.Задания.Удалить(МассивСтрок[0]);
	
	Попытка
		Если Записать(Новый Структура("РежимЗаписи,РежимПроведения", РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный)) Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось записать документ " + Объект;
		Сообщение.Сообщить();
		ОтменитьТранзакцию();
	КонецПопытки;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТранспортнойНакладной(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

//<< Горбунов По письму Петрушина сделал автоматическое изменение статусов ЗаявкНаТранспорт при установке "Закрыт" в Тренспортнике.
&НаКлиенте
Процедура ЗакрытьВсеЗаявки(Команда)
	Если Объект.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.Закрыт Тогда
		Если Не ПроверитьСтатусыЗаявокНаТранспорт() Тогда
			Ответ = Вопрос("Есть заявки на транспорт без статуса ""Закрыта""" + Символы.ПС +  "установить у всех заявок статус ""Закрыта?""", РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				ПровестиЗаявкиНаТранспортИзТранспортногоМаршрута();
			Иначе
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПроверитьСтатусыЗаявокНаТранспорт()
	ВсеСтатусыЗакрыты = Истина;
	Для Каждого СтрЗадания Из Объект.Задания Цикл
		Если Не СтрЗадания.ЗаявкаНаТранспорт.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.Закрыт Тогда
			ВсеСтатусыЗакрыты = Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат ВсеСтатусыЗакрыты;
КонецФункции

Процедура ПровестиЗаявкиНаТранспортИзТранспортногоМаршрута()
	Для Каждого СтрЗадания Из Объект.Задания Цикл
		ОбъектЗадание = СтрЗадания.ЗаявкаНаТранспорт.ПолучитьОбъект();
		ОбъектЗадание.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.Закрыт;
		СтрЗадания.Статус = Перечисления.абс_СтатусыЗаявокНаТранспорт.Закрыт;
		Попытка
			ОбъектЗадание.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось провести документ: " + ОбъектЗадание);
		КонецПопытки;
		
	КонецЦикла;
КонецПроцедуры
//>> Горбунов
